# Name: Subhajit Pramanik

# Department of Economic Science

# Roll Number: 18398

# Database Management System - DSE 310

# Assignment 2

# Installing packages

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\subha\anaconda3\lib\site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\subha\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\subha\anaconda3\lib\site-packages (1.1.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\subha\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\subha\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\subha\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\subha\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

# Importing packages

In [3]:
import pandas as pd

In [4]:
import mysql.connector
from mysql.connector import Error

# Defining Functions

In [5]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print("Error: '{err}'")

    return connection

In [6]:
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print("Error: '{err}'")

In [7]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print("Error: '{err}'")

In [8]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print("Error: '{err}'")

# Creating a table

In [10]:
create_classtable3 = """
CREATE TABLE classtable3 (
  RollNumber INT NOT NULL UNIQUE,
  Name VARCHAR(40) NOT NULL,
  Year VARCHAR(10),
  Marks INT,
  Gender VARCHAR(2),
  Subject VARCHAR(20) NOT NULL PRIMARY KEY UNIQUE
  
  );
 """

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class") # Connect to the Database
execute_query(connection, create_classtable3) # Execute our defined query

MySQL Database connection successful
Query successful

In [11]:
create_classteacher3_table = """
CREATE TABLE classteacher3 (
  PFID INT NOT NULL PRIMARY KEY,
  Name VARCHAR(40) NOT NULL,
  Subject VARCHAR(20),
  Gender VARCHAR(8),
  Age INT
);
 """

create_classroom3_table = """
CREATE TABLE classroom3 (
  Room INT NOT NULL PRIMARY KEY,
  BuildingName VARCHAR(40) NOT NULL
);
"""


connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, create_classteacher3_table)
execute_query(connection, create_classroom3_table)

MySQL Database connection successful
Query successful
Query successful

In [12]:
alter_classteacher3 = """
ALTER TABLE classteacher3
ADD FOREIGN KEY(classteacher3)
REFERENCES classteacher3(Subject)
ON DELETE SET NULL;
"""

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, alter_classteacher3)

MySQL Database connection successful
Error: '{err}'

# Drop table

In [13]:
drop_table = """DROP TABLE classroom3"""

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class") 
execute_query(connection, drop_table)

MySQL Database connection successful
Query successful

# Inserting data into the table

In [14]:
pop_classtable3 = """
INSERT INTO classtable3 VALUES
(1, "John", "Four", 75, "F", "BIO"),
(2, "Max", "Three", 85, "M", "PHY"), 
(3, "Jerry", "Three", 55, "F", "CHM"),
(4, "Andreas", "Four", 60, "M", "ECO"),
(5, "Tes", "Second", 78, "M", "DSE")
"""
connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, pop_classtable3)

MySQL Database connection successful
Query successful

In [15]:
pop_classteacher3 = """
INSERT INTO classteacher3 VALUES
(101, "Matt", "CHM", "M", 28),
(102, "Janet", "PHY",  "F", 27), 
(103, "Phil", "BIO", "M", 25),
(104, "Andreas",  "ECO", "M", 32),
(105, "Nicolas", "GT", "M", 40)
"""
connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, pop_classteacher3)

MySQL Database connection successful
Query successful

# SELECT Command

In [16]:
q1 = """
SELECT *
FROM classtable3;
"""

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
results = read_query(connection, q1)

for result in results:
  print(result)

MySQL Database connection successful
(1, 'John', 'Four', 75, 'F', 'BIO')
(3, 'Jerry', 'Three', 55, 'F', 'CHM')
(5, 'Tes', 'Second', 78, 'M', 'DSE')
(4, 'Andreas', 'Four', 60, 'M', 'ECO')
(2, 'Max', 'Three', 85, 'M', 'PHY')

In [17]:
q2 = """
SELECT Name, Gender
FROM classtable3;
"""
q3 = """
SELECT *
FROM classtable3
WHERE Marks < 70;
"""
connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
results2 = read_query(connection, q2)
results3 = read_query(connection, q3)

for result in results3:
    print(result)
for result in results2:
    print(result)

MySQL Database connection successful
(3, 'Jerry', 'Three', 55, 'F', 'CHM')
(4, 'Andreas', 'Four', 60, 'M', 'ECO')
('John', 'F')
('Jerry', 'F')
('Tes', 'M')
('Andreas', 'M')
('Max', 'M')

In [18]:
# Returns a list of lists and then creates a pandas DataFrame
from_db = []

for result in results:
  result = list(result)
  from_db.append(result)


columns = ["RollNumber", "Name", "Year", "Gender", "Age", "Subject"]
df = pd.DataFrame(from_db, columns=columns)

display(df)

   RollNumber     Name    Year  Gender Age Subject
0           1     John    Four      75   F     BIO
1           3    Jerry   Three      55   F     CHM
2           5      Tes  Second      78   M     DSE
3           4  Andreas    Four      60   M     ECO
4           2      Max   Three      85   M     PHY

In [19]:
from_db1 = []

for result in results2:
  result = list(result)
  from_db1.append(result)


columns1 = ["Name", "Gender"]
df1 = pd.DataFrame(from_db1, columns=columns1)

display(df1)

      Name Gender
0     John      F
1    Jerry      F
2      Tes      M
3  Andreas      M
4      Max      M

# Updating data in table

# Modify a Table

In [20]:
alter3 = """
ALTER TABLE classteacher3
RENAME COLUMN Subject TO Department;
"""


connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, alter3)

MySQL Database connection successful
Query successful

In [21]:
q5 = """
SELECT *
FROM classteacher3
WHERE Gender = "M";
"""
connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
results3 = read_query(connection, q5)

for i in results3:
  print(i)

MySQL Database connection successful
(101, 'Matt', 'CHM', 'M', 28)
(103, 'Phil', 'BIO', 'M', 25)
(104, 'Andreas', 'ECO', 'M', 32)
(105, 'Nicolas', 'GT', 'M', 40)

## Deleting Records from a table

In [22]:
q6 = """
SELECT *
FROM classtable3;
"""

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
results = read_query(connection, q6)

from_db = []

for result in results:
  print(result)

MySQL Database connection successful
(1, 'John', 'Four', 75, 'F', 'BIO')
(3, 'Jerry', 'Three', 55, 'F', 'CHM')
(5, 'Tes', 'Second', 78, 'M', 'DSE')
(4, 'Andreas', 'Four', 60, 'M', 'ECO')
(2, 'Max', 'Three', 85, 'M', 'PHY')

In [25]:
delete_classtable3 = """
DELETE FROM classtable3 WHERE RollNumber = 2;
"""

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, delete_classtable3)

MySQL Database connection successful
Query successful

In [26]:
q7 = """
SELECT *
FROM classtable3;
"""

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
results = read_query(connection, q7)

from_db = []

for result in results:
  print(result)

MySQL Database connection successful
(1, 'John', 'Four', 75, 'F', 'BIO')
(3, 'Jerry', 'Three', 55, 'F', 'CHM')
(5, 'Tes', 'Second', 78, 'M', 'DSE')
(4, 'Andreas', 'Four', 60, 'M', 'ECO')

#

## Creating a new user

In [27]:
create_user = """CREATE USER 'red'@'localhost' IDENTIFIED BY 'Home20';"""
connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, create_user)

show = read_query(connection, """SHOW GRANTS FOR 'red'@'localhost';""")
for result in show:
  print(result)

execute_query(connection, "FLUSH PRIVILEGES;")

MySQL Database connection successful
Error: '{err}'
('GRANT USAGE ON *.* TO `red`@`localhost`',)
Query successful

# Granting Privilages

In [28]:
grant_privilages = """Grant SELECT,insert on class.classtable3 to 'root'@'localhost'"""

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, grant_privilages)

results = read_query(connection, """SHOW GRANTS FOR 'root'@'localhost';""")

for result in results:
  print(result)

MySQL Database connection successful
Query successful
('GRANT SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, RELOAD, SHUTDOWN, PROCESS, FILE, REFERENCES, INDEX, ALTER, SHOW DATABASES, SUPER, CREATE TEMPORARY TABLES, LOCK TABLES, EXECUTE, REPLICATION SLAVE, REPLICATION CLIENT, CREATE VIEW, SHOW VIEW, CREATE ROUTINE, ALTER ROUTINE, CREATE USER, EVENT, TRIGGER, CREATE TABLESPACE, CREATE ROLE, DROP ROLE ON *.* TO `root`@`localhost` WITH GRANT OPTION',)
('GRANT APPLICATION_PASSWORD_ADMIN,AUDIT_ABORT_EXEMPT,AUDIT_ADMIN,AUTHENTICATION_POLICY_ADMIN,BACKUP_ADMIN,BINLOG_ADMIN,BINLOG_ENCRYPTION_ADMIN,CLONE_ADMIN,CONNECTION_ADMIN,ENCRYPTION_KEY_ADMIN,FLUSH_OPTIMIZER_COSTS,FLUSH_STATUS,FLUSH_TABLES,FLUSH_USER_RESOURCES,GROUP_REPLICATION_ADMIN,GROUP_REPLICATION_STREAM,INNODB_REDO_LOG_ARCHIVE,INNODB_REDO_LOG_ENABLE,PASSWORDLESS_USER_ADMIN,PERSIST_RO_VARIABLES_ADMIN,REPLICATION_APPLIER,REPLICATION_SLAVE_ADMIN,RESOURCE_GROUP_ADMIN,RESOURCE_GROUP_USER,ROLE_ADMIN,SERVICE_CONNECTION_ADMIN,SESSION_VARIABLES_ADMIN,SET_USER_ID,SHOW_ROUTINE,SYSTEM_USER,SYSTEM_VARIABLES_ADMIN,TABLE_ENCRYPTION_ADMIN,XA_RECOVER_ADMIN ON *.* TO `root`@`localhost` WITH GRANT OPTION',)
('GRANT SELECT ON `class`.`classtable1` TO `root`@`localhost`',)
('GRANT SELECT, INSERT ON `class`.`classtable3` TO `root`@`localhost`',)
('GRANT SELECT, INSERT ON `class`.`classtable` TO `root`@`localhost`',)
('GRANT SELECT, INSERT ON `staff`.`staffmanagers` TO `root`@`localhost`',)
('GRANT PROXY ON ``@`` TO `root`@`localhost` WITH GRANT OPTION',)

# Revoking Privilages

In [29]:
revoke_privilages = """revoke insert on class.classtable3 from 'root'@'localhost';"""

connection = create_db_connection("localhost", "root", "Subhajitecon@18398", "class")
execute_query(connection, revoke_privilages)

results = read_query(connection, """SHOW GRANTS FOR 'root'@'localhost';""")

for result in results:
  print(result)

MySQL Database connection successful
Query successful
('GRANT SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, RELOAD, SHUTDOWN, PROCESS, FILE, REFERENCES, INDEX, ALTER, SHOW DATABASES, SUPER, CREATE TEMPORARY TABLES, LOCK TABLES, EXECUTE, REPLICATION SLAVE, REPLICATION CLIENT, CREATE VIEW, SHOW VIEW, CREATE ROUTINE, ALTER ROUTINE, CREATE USER, EVENT, TRIGGER, CREATE TABLESPACE, CREATE ROLE, DROP ROLE ON *.* TO `root`@`localhost` WITH GRANT OPTION',)
('GRANT APPLICATION_PASSWORD_ADMIN,AUDIT_ABORT_EXEMPT,AUDIT_ADMIN,AUTHENTICATION_POLICY_ADMIN,BACKUP_ADMIN,BINLOG_ADMIN,BINLOG_ENCRYPTION_ADMIN,CLONE_ADMIN,CONNECTION_ADMIN,ENCRYPTION_KEY_ADMIN,FLUSH_OPTIMIZER_COSTS,FLUSH_STATUS,FLUSH_TABLES,FLUSH_USER_RESOURCES,GROUP_REPLICATION_ADMIN,GROUP_REPLICATION_STREAM,INNODB_REDO_LOG_ARCHIVE,INNODB_REDO_LOG_ENABLE,PASSWORDLESS_USER_ADMIN,PERSIST_RO_VARIABLES_ADMIN,REPLICATION_APPLIER,REPLICATION_SLAVE_ADMIN,RESOURCE_GROUP_ADMIN,RESOURCE_GROUP_USER,ROLE_ADMIN,SERVICE_CONNECTION_ADMIN,SESSION_VARIABLES_ADMIN,SET_USER_ID,SHOW_ROUTINE,SYSTEM_USER,SYSTEM_VARIABLES_ADMIN,TABLE_ENCRYPTION_ADMIN,XA_RECOVER_ADMIN ON *.* TO `root`@`localhost` WITH GRANT OPTION',)
('GRANT SELECT ON `class`.`classtable1` TO `root`@`localhost`',)
('GRANT SELECT ON `class`.`classtable3` TO `root`@`localhost`',)
('GRANT SELECT, INSERT ON `class`.`classtable` TO `root`@`localhost`',)
('GRANT SELECT, INSERT ON `staff`.`staffmanagers` TO `root`@`localhost`',)
('GRANT PROXY ON ``@`` TO `root`@`localhost` WITH GRANT OPTION',)